ERP.belugaerp/src/Reports/ОстаткиИДоступностьТоваров/ОстаткиИДоступностьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОстаткиИДоступностьТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Report>

ERP.belugaerp/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварыКОтгрузке</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>ВРезерве</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КОформлению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КСборке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собирается</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собрано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ХарактеристикиУпаковокПаллет/бг_ХарактеристикиУпаковокПаллет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ХарактеристикиУпаковокПаллет</name>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УпаковкаПаллета</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Reports/ОстаткиИДоступностьТоваров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&Перед("ПриКомпоновкеРезультата")
Процедура бг_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.Основной.Запрос;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	КоличествоПакетов = СхемаЗапроса.ПакетЗапросов.Количество();
	Для ИндексПакета = 0 По КоличествоПакетов - 1 Цикл
		ЗапросВыбора = СхемаЗапроса.ПакетЗапросов[ИндексПакета];	
		Для каждого ОператорВыбора Из ЗапросВыбора.Операторы Цикл
			
			ИсточникТоварыКОтгрузке = ОператорВыбора.Источники.НайтиПоПсевдониму("ТоварыКОтгрузке");
			
			Если ИсточникТоварыКОтгрузке = Неопределено Тогда
				Продолжить;	
			КонецЕсли;
			
			Если СтрСравнить(ИсточникТоварыКОтгрузке.Источник.ИмяТаблицы, "РегистрНакопления.ТоварыКОтгрузке.Остатки") <> 0 Тогда
				Продолжить;	
			КонецЕсли;

			ОператорВыбора.Источники.Добавить("РегистрСведений.бг_ХарактеристикиУпаковокПаллет", "ХарактеристикиУпаковокПаллет");
			ИсточникХарактеристикиУпаковокПаллет = ОператорВыбора.Источники.НайтиПоПсевдониму("ХарактеристикиУпаковокПаллет");
			
			ИсточникТоварыКОтгрузке.Соединения.Добавить(
				ИсточникХарактеристикиУпаковокПаллет,
				ИсточникТоварыКОтгрузке.Источник.Псевдоним +
					".Номенклатура = ХарактеристикиУпаковокПаллет.Номенклатура");
			ИсточникТоварыКОтгрузке.Соединения.Добавить(
				ИсточникХарактеристикиУпаковокПаллет,
				ИсточникТоварыКОтгрузке.Источник.Псевдоним +
					".Серия.бг_УпаковкаПаллета = ХарактеристикиУпаковокПаллет.УпаковкаПаллета");
			
			ВыбираемыеПоля = ОператорВыбора.ВыбираемыеПоля;
			КоличествоПолей = ВыбираемыеПоля.Количество();
			Для ИндексПоля = 0 По КоличествоПолей - 1 Цикл
				ТекстПоля = Строка(ВыбираемыеПоля[ИндексПоля]);
				Если СтрСравнить(ТекстПоля, ИсточникТоварыКОтгрузке.Источник.Псевдоним + ".Характеристика") = 0 Тогда	
					ВыражениеПоляХарактеристика = Новый ВыражениеСхемыЗапроса(
						"ЕСТЬNULL(ХарактеристикиУпаковокПаллет.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))"); 
					ВыбираемыеПоля.Установить(ИндексПоля, ВыражениеПоляХарактеристика);	
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	СхемаКомпоновкиДанных.НаборыДанных.Основной.Запрос = ТекстЗапроса;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
